Wang/nn_chemistry/detonationFoamTimingNS/constant/chemFFCM2
species
9
(
H
H2
O
O2
OH
H2O
HO2
H2O2
AR
)
;

reactions
{
    ffcm2-0
    {
            type            reversibleArrheniusReaction;
            reaction       "H + O2 = O + OH";
            A               1.04e+11;
            beta            0;
            Ta              7704.29;
    }
    ffcm2-1
    {
            type            reversibleArrheniusReaction;
            reaction        "H2 + O = H + OH";
            A               3.649e+09;
            beta            0;
            Ta              4000.6;
    }
    ffcm2-2
    {
            type            reversibleArrheniusReaction;
            reaction        "H2 + O = H + OH";
            A               7.602e+11;
            beta            0;
            Ta              9651.75;
    }
    ffcm2-3
    {
            type            reversibleArrheniusReaction;
            reaction        "H2 + OH = H + H2O";
            A               2.158e+05;
            beta            1.51;
            Ta              1729.57;
    }
    ffcm2-4
    {
            type            reversibleArrheniusReaction;
            reaction        "2 OH = H2O + O";
            A               33.5;
            beta            2.42;
            Ta              -970.207;
    }
    ffcm2-5
    {
            type            reversiblethirdBodyArrheniusReaction;
            reaction        "H2  = 2 H ";
            A               3.877e+16;
            beta            -1.4;
            Ta              52531.1;
        coeffs          
9
(
(H 1.0)
(H2 2.5)
(O 1.0)
(O2 1.0)
(OH 1.0)
(H2O 12.0)
(HO2 1.0)
(H2O2 1.0)
(AR 0.0)
)
;
    }
    ffcm2-6
    {
            type            reversibleArrheniusReaction;
            reaction        "H2 + AR = 2 H + AR";
            A               5.84e+15;
            beta            -1.1;
            Ta              52531.1;
    }
    ffcm2-7
    {
            type            reversiblethirdBodyArrheniusReaction;
            reaction        "2 O  = O2 ";
            A               6.16e+09;
            beta            -0.5;
            Ta              0;
        coeffs          
9
(
(H 1.0)
(H2 2.5)
(O 1.0)
(O2 1.0)
(OH 1.0)
(H2O 12.0)
(HO2 1.0)
(H2O2 1.0)
(AR 0.0)
)
;
    }
    ffcm2-8
    {
            type            reversibleArrheniusReaction;
            reaction        "2 O + AR = O2 + AR";
            A               1.89e+07;
            beta            0;
            Ta              -899.757;
    }
    ffcm2-9
    {
            type            reversiblethirdBodyArrheniusReaction;
            reaction        "H + O  = OH ";
            A               4.712e+12;
            beta            -1;
            Ta              0;
        coeffs          
9
(
(H 1.0)
(H2 2.5)
(O 1.0)
(O2 1.0)
(OH 1.0)
(H2O 12.0)
(HO2 1.0)
(H2O2 1.0)
(AR 0.75)
)
;
    }
    ffcm2-10
    {
            type            reversiblethirdBodyArrheniusReaction;
            reaction        "H2O  = H + OH ";
            A               5.903e+24;
            beta            -3.32;
            Ta              60788.9;
        coeffs          
9
(
(H 1.0)
(H2 3.0)
(O 1.0)
(O2 1.5)
(OH 1.0)
(H2O 0.0)
(HO2 1.0)
(H2O2 1.0)
(AR 1.0)
)
;
    }
    ffcm2-11
    {
            type            reversibleArrheniusReaction;
            reaction        "H2O + H2O = H + OH + H2O";
            A               1.01e+23;
            beta            -2.44;
            Ta              60487;
    }
    ffcm2-12
    {
            type            reversibleArrheniusTroeFallOffReaction;
            reaction        "H + O2  = HO2 ";
            k0
        {
            A               7.242e+14;
            beta            -1.72;
            Ta              264.19;
        }
        kInf
        {
            A               5.286e+09;
            beta            0.44;
            Ta              0;
        }
        F
        {
            alpha           0.5;
            Tsss            30;
            Ts              90000;
            Tss             90000;
        }
        thirdBodyEfficiencies
        {
            coeffs          
9
(
(H 1.0)
(H2 2.0)
(O 1.0)
(O2 0.78)
(OH 1.0)
(H2O 13.76974842661546)
(HO2 1.0)
(H2O2 1.0)
(AR 0.6867116639685282)
)
;
        }
    }
    ffcm2-13
    {
            type            reversibleArrheniusReaction;
            reaction        "H + HO2 = H2 + O2";
            A               3273;
            beta            2.09;
            Ta              -732.184;
    }
    ffcm2-14
    {
            type            reversibleArrheniusReaction;
            reaction        "H + HO2 = 2 OH";
            A               6.36e+10;
            beta            0;
            Ta              150.966;
    }
    ffcm2-15
    {
            type            reversibleArrheniusReaction;
            reaction        "H + HO2 = H2O + O";
            A               1.613e+09;
            beta            0;
            Ta              0;
    }
    ffcm2-16
    {
            type            reversibleArrheniusReaction;
            reaction        "HO2 + O = O2 + OH";
            A               1.721e+10;
            beta            0;
            Ta              -223.933;
    }
    ffcm2-17
    {
            type            reversibleArrheniusReaction;
            reaction        "HO2 + OH = H2O + O2";
            A               7.637e+09;
            beta            0;
            Ta              -550.019;
    }
    ffcm2-18
    {
            type            reversibleArrheniusReaction;
            reaction        "HO2 + OH = H2O + O2";
            A               4.5e+11;
            beta            0;
            Ta              5500.19;
    }
    ffcm2-19
    {
            type            reversibleArrheniusReaction;
            reaction        "2 HO2 = H2O2 + O2";
            A               1.94e+08;
            beta            0;
            Ta              -709.036;
    }
    ffcm2-20
    {
            type            reversibleArrheniusReaction;
            reaction        "2 HO2 = H2O2 + O2";
            A               1.03e+11;
            beta            0;
            Ta              5555.54;
    }
    ffcm2-21
    {
            type            reversibleArrheniusTroeFallOffReaction;
            reaction        "H2O2  = 2 OH ";
            k0
        {
            A               2.397e+21;
            beta            -2.3;
            Ta              24532;
        }
        kInf
        {
            A               1.925e+12;
            beta            0.9;
            Ta              24532;
        }
        F
        {
            alpha           0.58;
            Tsss            30;
            Ts              90000;
            Tss             90000;
        }
        thirdBodyEfficiencies
        {
            coeffs          
9
(
(H 1.0)
(H2 3.7)
(O 1.0)
(O2 1.2)
(OH 1.0)
(H2O 7.5)
(HO2 1.0)
(H2O2 7.7)
(AR 0.9859595379900199)
)
;
        }
    }
    ffcm2-22
    {
            type            reversibleArrheniusReaction;
            reaction        "H + H2O2 = H2O + OH";
            A               2.41e+10;
            beta            0;
            Ta              1997.78;
    }
    ffcm2-23
    {
            type            reversibleArrheniusReaction;
            reaction        "H + H2O2 = H2 + HO2";
            A               4.82e+10;
            beta            0;
            Ta              4000.6;
    }
    ffcm2-24
    {
            type            reversibleArrheniusReaction;
            reaction        "H2O2 + O = HO2 + OH";
            A               9630;
            beta            2;
            Ta              1997.78;
    }
    ffcm2-25
    {
            type            reversibleArrheniusReaction;
            reaction        "H2O2 + OH = H2O + HO2";
            A               1.761e+09;
            beta            0;
            Ta              160.024;
    }
    ffcm2-26
    {
            type            reversibleArrheniusReaction;
            reaction        "H2O2 + OH = H2O + HO2";
            A               7.631e+10;
            beta            0;
            Ta              3658.41;
    }
}
