Wang/nn_chemistry/detonationFoamTimingNS/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libdynamicMesh2D.so"
    "libdynamicFvMesh2D.so"
);


dynamicFvMesh   dynamicRefineFvMesh2D;
dynamicRefineFvMesh2DCoeffs{

    axis 2;
    axisVal 00;

refineInterval  10; 

field           magGradrho;

lowerRefineLevel 200;
upperRefineLevel 10000000000;

unrefineLevel   200;

nBufferLayers   20;
nBufferLayersR   20;

maxRefinement   3;

maxCells        30000000;

correctFluxes
(
    (phiM none)
    (phiCorr none)
    (phiT none)
    (phi none)
    (rhoPhi none)
    (rhoUPhi none)
    (rhoEPhi none)
    (neg none)
    (pos none)
    (e_neg none)
    (e_pos none)
    (aphiv_pos none)
    (aphiv_neg none)
    (a_pos none)
    (a_neg none)
    (rPsi_pos none)
    (rPsi_neg none)
    (interpolate(rho) none)
    (p_pos none)
    (p_neg none)
    (HLL::SNei none)
    (HLL::SOwn none)
    (HLL::SStar none)
    (HLL::pStar none)
    (HLLC::SNei none)
    (HLLC::SOwn none)
    (HLLC::SStar none)
    (HLLC::pStar none)
    (HLLCP::SNei none)
    (HLLCP::SOwn none)
    (HLLCP::SStar none)
    (HLLCP::pStar none)
    (fluxScheme::own none)
    (amaxSf none)
    (HLL::UvNei none)
    (HLL::UvOwn none)
    (HLLC::UvNei none)
    (HLLC::UvOwn none)
    (HLLCP::UvNei none)
    (HLLCP::UvOwn none)
    (am_ref none)
    (rho_pos none)
    (cSf_neg none)
    (cSf_pos none)
    (HLLC::phip none)
    (HLLCP::phip none)
    (ap_ref none)
    (aSf_ref none)
    (phiv_pos none)
    (phiv_neg none)
    (rho_neg none)
    (fluxScheme::nei none)
    (HLL::pStarNei none)
    (HLL::pStarOwn none)
    (HLLC::pStarNei none)
    (HLLC::pStarOwn none)
    (HLLCP::pStarNei none)
    (HLLCP::pStarOwn none)
    (Kurganov::aNei none)
    (Kurganov::aOwn none)
    (Kurganov::aSf none)
    (Kurganov::aPhivOwn none)
    (Kurganov::aPhivNei none)
    (AUSMPlus::phi none)
    (AUSMPlusUp::phi none)
);

// Write the refinement level as a volScalarField
dumpLevel       true;

};
// ************************************************************************* //
