Wang/nn_chemistry/detonationFoamTimingNS/constant/openfoam_transport.txt
H
{
    geometry              atom;
    LennardJonesWellDepth 145.0;
    LennardJonesDiameter  2.050;
    dipoleMoment          0.000;
    polarizability        0.000;
    rotRelax              0.000;
}

H2
{
    geometry              linear;
    LennardJonesWellDepth 38.000;
    LennardJonesDiameter  2.920;
    dipoleMoment          0.000;
    polarizability        0.790;
    rotRelax              280.000;
}

O
{
    geometry              atom;
    LennardJonesWellDepth 80.000;
    LennardJonesDiameter  2.750;
    dipoleMoment          0.000;
    polarizability        0.000;
    rotRelax              0.000;
}

O2
{
    geometry              linear;
    LennardJonesWellDepth 107.400;
    LennardJonesDiameter  3.458;
    dipoleMoment          0.000;
    polarizability        1.600;
    rotRelax              3.800;
}

OH
{
    geometry              linear;
    LennardJonesWellDepth 80.000;
    LennardJonesDiameter  2.750;
    dipoleMoment          0.000;
    polarizability        0.000;
    rotRelax              0.000;
}

H2O
{
    geometry              nonlinear;
    LennardJonesWellDepth 572.400;
    LennardJonesDiameter  2.605;
    dipoleMoment          1.844;
    polarizability        0.000;
    rotRelax              4.000;
}

HO2
{
    geometry              nonlinear;
    LennardJonesWellDepth 107.400;
    LennardJonesDiameter  3.458;
    dipoleMoment          0.000;
    polarizability        0.000;
    rotRelax              1.000;
}

H2O2
{
    geometry              nonlinear;
    LennardJonesWellDepth 107.400;
    LennardJonesDiameter  3.458;
    dipoleMoment          0.000;
    polarizability        0.000;
    rotRelax              3.800;
}

AR
{
    geometry              atom;
    LennardJonesWellDepth 136.500;
    LennardJonesDiameter  3.330;
    dipoleMoment          0.000;
    polarizability        0.000;
    rotRelax              0.000;
}

