Wang/nn_chemistry/detonationFoamTimingNS/constant/thermFFCM2_generated

/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  6
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.compressibleGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * /

    H
    {
        specie
        {
            molWeight    1.008;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.5 0.0 0.0 0.0 0.0 25473.66 -0.44668285);
            lowCpCoeffs    (2.5 0.0 0.0 0.0 0.0 25473.66 -0.44668285);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    H2
    {
        specie
        {
            molWeight    2.016;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.93286575 0.000826608026 -1.46402364e-07 1.54100414e-11 -6.888048e-16 -813.065581 -1.02432865);
            lowCpCoeffs    (2.34433112 0.00798052075 -1.9478151e-05 2.01572094e-08 -7.37611761e-12 -917.935173 0.683010238);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    O
    {
        specie
        {
            molWeight    15.999;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.54363697 -2.73162486e-05 -4.1902952e-09 4.95481845e-12 -4.79553694e-16 29226.012 4.92229457);
            lowCpCoeffs    (3.1682671 -0.00327931884 6.64306396e-06 -6.12806624e-09 2.11265971e-12 29122.2592 2.05193346);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    O2
    {
        specie
        {
            molWeight    31.998;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (3.66096065 0.000656365811 -1.41149627e-07 2.05797935e-11 -1.29913436e-15 -1215.97718 3.41536279);
            lowCpCoeffs    (3.78245636 -0.00299673416 9.84730201e-06 -9.68129509e-09 3.24372837e-12 -1063.94356 3.65767573);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    OH
    {
        specie
        {
            molWeight    17.007;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.83853033 0.00110741289 -2.94000209e-07 4.20698729e-11 -2.4228989e-15 3697.80808 5.84494652);
            lowCpCoeffs    (3.99198424 -0.00240106655 4.61664033e-06 -3.87916306e-09 1.36319502e-12 3368.89836 -0.103998477);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    H2O
    {
        specie
        {
            molWeight    18.015;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.6770389 0.0029731816 -7.7376889e-07 9.4433514e-11 -4.2689991e-15 -29885.894 6.88255);
            lowCpCoeffs    (4.1986352 -0.0020364017 6.5203416e-06 -5.4879269e-09 1.771968e-12 -30293.726 -0.84900901);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    HO2
    {
        specie
        {
            molWeight    33.006;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    5000.0;
            Tcommon    1000.0;
            highCpCoeffs    (4.17228741 0.00188117627 -3.46277286e-07 1.94657549e-11 1.76256905e-16 31.0206839 2.95767672);
            lowCpCoeffs    (4.30179807 -0.00474912097 2.11582905e-05 -2.42763914e-08 9.29225225e-12 264.018485 3.7166622);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    H2O2
    {
        specie
        {
            molWeight    34.014;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (4.57977305 0.00405326003 -1.2984473e-06 1.982114e-10 -1.13968792e-14 -18007.1775 0.664970694);
            lowCpCoeffs    (4.31515149 -0.000847390622 1.76404323e-05 -2.26762944e-08 9.08950158e-12 -17706.7437 3.27373319);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    
    AR
    {
        specie
        {
            molWeight    39.95;
        }
        thermodynamics
        {
            Tlow    200.0;
            Thigh    6000.0;
            Tcommon    1000.0;
            highCpCoeffs    (2.5 0.0 0.0 0.0 0.0 -745.375 4.37967491);
            lowCpCoeffs    (2.5 0.0 0.0 0.0 0.0 -745.375 4.37967491);
        }
        transport
        {
            As    1.67e-06; //possibly unused
            Ts    170.0; //possibly unused
        }
    }
    