Wang/nn_chemistry/detonationFoamTimingNS/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs
(
    "libchemistryModel_DLB.so" 
    "libdynamicMesh2D.so"
    "libdynamicFvMesh2D.so"
);


application     detonationNSFoam_Sutherland;

startFrom       latestTime;

startTime       0e-6;

stopAt          endTime;

endTime         2e-4;

deltaT          1e-9;

writeControl    adjustableRunTime;

writeInterval	1e-6;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

adjustTimeStep  no;

useAcousticCourant yes;

maxCo           0.2;
maxDeltaT		1e-6;
maxAcousticCo	0.2;

functions
{
}

// ************************************************************************* //
