Wang/nn_chemistry/detonationFoamTimingNS/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// This will be defined by the number cpus used for the job!
numberOfSubdomains 128;

method          simple;
// NOTE: n must multiply to be equal to the number of cpus, this will create the cpu subdomains...
simpleCoeffs
{
    n               (16 8 1);
    delta           0.00001;
}

hierarchicalCoeffs
{
    n               (1 1 1);
    delta           0.00001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots           ( );


// ************************************************************************* //
