Wang/nn_chemistry/detonationFoamTimingNS/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;

    root            "/.automount/werner/Werner/bgschaid/bgschaid-foamStuff/DepositionTests";
    case            "neutralTest";
    instance        "system";
    local           "";

    class           dictionary;
    object          funkySetFieldsDict;
}

expressions
(
	pressureset1
	{
		field p;
                create 1;
		expression "8000";
		valuePatches ( zminus );
		dimension [1 -1 -2 0 0 0 0];
	}
	pressureset2
	{
		field p;
		expression "151987.5";
		condition "(pos().x <= 0.006*sin(pos().y*50*2*3.1415926+50*0.25*3.1415926)+0.01)  ";
		valuePatches ( zminus );
                keepPatches 1;
		dimension [1 -1 -2 0 0 0 0];
	}
	velocityset
	{
		field U;
                create 1;
		expression "vector(0,0,0)";
		valuePatches ( zminus );
		dimension [0 1 -1 0 0 0 0];
	}
	temperatureset1
	{
		field T;
                create 1;
		expression "300";
		valuePatches ( zminus );
		dimension [0 0 0 1 0 0 0];
	}
	temperatureset2
	{
		field T;
		expression "1800";
		condition "(pos().x <= 0.006*sin(pos().y*50*2*3.1415926+50*0.25*3.1415926)+0.01)  ";
		valuePatches ( zminus );
	}
);
