Wang/nn_chemistry/detonationFoamTimingNS/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;

    root            "/.automount/werner/Werner/bgschaid/bgschaid-foamStuff/DepositionTests";
    case            "neutralTest";
    instance        "system";
    local           "";

    class           dictionary;
    object          setFieldsDict;
}

defaultFieldValues
(
        volScalarFieldValue p 6670
        volScalarFieldValue T 298
        volScalarFieldValue H2 0.012772427774961983
        volScalarFieldValue O2 0.10136213887480991
        volScalarFieldValue H2O 0.0
        volScalarFieldValue AR 0.8858654333502279
);

regions
(
    // Setting high pressure where x < 0.005
    boxToCell
    {
        box (0 -1 -1) (0.05 1 1);
        fieldValues
        (
            volScalarFieldValue p 5.5e5
            volScalarFieldValue T 2500
            volScalarFieldValue H2 0.0
            volScalarFieldValue O2 0.0
            volScalarFieldValue H2O 0.11413456664977206
            volScalarFieldValue AR 0.8858654333502279
        );
    }

    cylinderToCell
    {
        p1 (0.065 0.05 -1); p2 (0.065 0.05 1); radius 0.0025;
        fieldValues
        (
            volScalarFieldValue p 5.5e5
            volScalarFieldValue T 2500
            volScalarFieldValue H2 0.0
            volScalarFieldValue O2 0.0
            volScalarFieldValue H2O 0.11413456664977206
            volScalarFieldValue AR 0.8858654333502279
        );
    }

    cylinderToCell
    {
        p1 (0.0625 0.02 -1); p2 (0.0625 0.02 1); radius 0.0025;
        fieldValues
        (
            volScalarFieldValue p 5.5e5
            volScalarFieldValue T 2500
            volScalarFieldValue H2 0.0
            volScalarFieldValue O2 0.0
            volScalarFieldValue H2O 0.11413456664977206
            volScalarFieldValue AR 0.8858654333502279
        );
    }
);

